tutorials/incompressible/simpleFoam/simpleCar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      10;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs1
    {
        type        forceCoeffs;

        functionObjectLibs ( "libforces.so" );
        outputControl   outputTime;
        writeFields true;

        patches     (body);
        pName       p;
        UName       U;
        rhoName     rhoInf;      // Indicates incompressible
        log         true;
        rhoInf      1;           // Redundant for incompressible
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        CofR        (3.5 0 0);   // Axle midpoint on ground
        pitchAxis   (0 0 1);
        magUInf     10;
        lRef        4;           // Wheelbase length
        Aref        1;           // Estimated
        porosity    on;

        binData
        {
            nBin        20;          // output data into 20 bins
            direction   (1 0 0);     // bin direction
            cumulative  yes;
        }
    }
}

// ************************************************************************* //
